import math
w = float(input())
h = float(input())

limits = f'{3 <= h <= w <= 100}'
# 	Залата е широка 890 cm. От тях 100 cm отиват за коридора в средата. В останалите 790 cm могат да се
# 	разположат по 11 бюра на ред (11 * 70 cm = 770 cm + 20 cm остатък).
#Залата е дълга 1500 cm. В тях могат да бъдат разположени 12 реда (12 * 120 cm = 1440 + 60 cm остатък).
# Брой места = 12 * 11 - 3 =  132 - 3 = 129 (имаме 12 реда по 11 места = 132 минус 3 места за катедра и входна врата

desks_per_row_6 = 6 * 70
row_7 = 7 * 120
number_places = (row_7 * 6) - 3
print(number_places)

